asciiart-load-test.yml
config:
  plugins:
    publish-metrics:
    - type: 'open-telemetry'
      serviceName: 'artillery_poc'
      # Set attributes for all resources (metrics and traces):
      resourceAttributes:
        custom-attribute: 'smoketest'
      metrics:
        endpoint: 'http://100.24.113.139:14269/metrics'
      traces:
        endpoint: 'http://100.24.113.139:4318/v1/traces'
  # This is a test server run by team Artillery
  # It's designed to be highly scalable
  target: http://asciiart.artillery.io:8080
  phases:
    - duration: 60
      arrivalRate: 1
      rampTo: 5
      name: Warm up phase
    - duration: 60
      arrivalRate: 5
      rampTo: 10
      name: Ramp up load
    - duration: 30
      arrivalRate: 10
      rampTo: 30
      name: Spike phase
  # Load & configure a couple of useful plugins
  # https://docs.art/reference/extensions
  plugins:
    publish-metrics:
      - type: prometheus
        pushgateway: 'http://3.231.53.41:9091'
        tags:
          - 'testId:asciiart-load-test'
          - 'type:artillery-playwright-loadtest'
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  apdex:
    threshold: 100
  ensure:
    thresholds:
      - http.response_time.p99: 100
      - http.response_time.p95: 75
      
scenarios:
  - flow:
      - loop:
          - get:
              url: '/dino'
          - get:
              url: '/pony'
          - get:
              url: '/armadillo'
        count: 100